app/controllers/home_controller.rb

  def ShowSomeStuff

    itemS = Item.new

    itemS.name = "Request:" + Time.now.to_s + "OLOLO TROLOLO!!!"

    itemS.save

    @items = Item.all
---
INSERT INTO `items` (`name`) VALUES('Request:Fri Apr 15 18:49:25 +0300 2011')
SELECT * FROM `items`